<template>
  <div class="landing" v-bind:class="{visible: isShow}">
    <header :class="{'onscroll': scrolled}">
      <div class="logo" >
        <nuxt-link to="/">
          <img src="~assets/img/logo.svg" alt="">
        </nuxt-link>
      </div> 
      <div class="right">
        <div class="phone"><a href="tel:+74957907888">+7 495 790 78 88</a></div>
        <div class="feedback mobile">
            <svg v-scroll-to="'#screen-3'" width="29px" height="19px" viewBox="0 0 29 19" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
                <g id="Page-1" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
                    <g id="Mobile-Copy" transform="translate(-323.000000, -29.000000)" fill="$mainColor" fill-rule="nonzero">
                        <g id="Group-15" transform="translate(-5.000000, 0.000000)">
                            <path d="M355.820678,29 L328,29 L328,47.5601741 L357,47.5601741 L357,29 L355.820678,29 Z M354.659851,30.1597389 L343.456295,41.3632953 C342.944965,41.8746248 342.053947,41.8746248 341.542617,41.3632953 L330.336885,30.1597389 L354.658764,30.1597389 L354.659851,30.1597389 Z M329.159739,30.6221113 L336.691514,38.1527986 L329.159739,45.6845738 L329.159739,30.6210234 L329.159739,30.6221113 Z M330.085572,46.4004352 L337.512905,38.9741897 L340.723402,42.1835984 C341.197742,42.6579382 341.828744,42.9201306 342.5,42.9201306 C343.171256,42.9201306 343.802258,42.6579382 344.276598,42.1835984 L347.487095,38.9731017 L354.91334,46.3993472 L330.084484,46.3993472 L330.085572,46.4004352 Z M355.840261,45.6856618 L348.308486,38.1527986 L355.840261,30.6199355 L355.840261,45.6856618 Z" id="Shape"></path>
                        </g>
                    </g>
                </g>
            </svg>
        </div>
        <div class="feedback desktop">
            <a v-scroll-to="'#screen-3'" href="#" >Получить предложение</a>
        </div>
      </div>
    </header>
    <main>
      <b-container>
        <b-row class="inner-page policy">
          <b-col>
            <h2>Согласие для пользователя на обработку персональных данных о получение информации по каналам связи (SMS – рассылка и почтовая рассылка)</h2>
            <p>Являясь пользователем сайта <a href="http://birds.moscow/" target="_blank">www.birds.moscow</a>. &nbsp;(далее - Сайт) я, свободно и по собственной воле, действуя в своих интересах, соглашаюсь с условиями обработки и использования персональных данных и даю согласие ООО &laquo;ИМЕДИ&raquo; (далее - Оператор) на обработку моих персональных данных, в том числе сбор, запись, систематизацию, накопление, архивирование, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (предоставление, доступ), обезличивание, блокирование, удаление и уничтожение с использованием средств автоматизации или без использования таких средств, с целью консультации и обработки запросов и заявок Сайте, распространения новостных, информационных и рекламных сообщений по адресу оставленной мною электронной почты, или по номеру, оставленного мною мобильного телефона, улучшение качества Сайта, персонализации и повышения удобства пользования Сайтом, либо с иными целями, предусмотренными <nuxt-link to='policy'>Политикой в отношении обработки персональных данных</nuxt-link> ООО &laquo;ИМЕДИ&raquo; (далее - Политика).</p>
            <p>Мои персональные данные в отношении которых дается данное согласие, включают в себя все предоставленные мной данные при регистрации на Сайте, при заполнении контактной формы обратной связи, при направлении электронных писем Оператору и при пользовании Сайта включая, но не ограничиваясь: фамилию, имя, отчество; email; контактный телефон; адрес; должность; место работы.</p>
            <p>Также, с целью определения предпочтений посетителей Сайта, персонализации и повышения удобства пользования Сайтом&nbsp; я даю согласие на обработку администрацией Сайта следующих данных: источник захода на сайт и информация поискового или рекламного запроса; данные об устройстве (в частности, разрешение экрана, версия веб-браузера и другие атрибуты, характеризующие пользовательское устройство); пользовательские клики, нажатия на элементы веб-страниц, просмотры страниц, факты заполнения полей, сведения о просмотре баннеров и видео; данные о времени посещения; идентификаторы пользователя, хранимые в файлах &laquo;cookie&raquo;. Данная информация не используется для отслеживания информации о физических лицах и не позволяет его идентифицировать, но используется в совокупном уровне для того, чтобы улучшить использование сайта, для планирования маркетинговых активностей. Обработка вышеперечисленных данных Оператором происходит с использованием специализированных веб-приложений Google Analytics и &laquo;Яндекс.Метрика&raquo; в соответствии с правилами, ссылки на которые приведены ниже.</p>
            <ul>
            <li><a href="https://www.google.ru/policies/privacy/" target="_blank">Правила обработки персональных данных сервиса Google Analytics</a>, ООО &laquo;Гугл&raquo; (115035, г. Москва, ул. Балчуг, д.7)</li>
            <li><a href="https://yandex.ru/legal/confidential/" target="_blank">Правила обработки персональных данных сервиса &laquo;Яндекс.Метрика&raquo;</a>, ООО &laquo;ЯНДЕКС&raquo; (119034, г. Москва, ул. Льва Толстого, д.16)</li>
            </ul>
            <p>Предоставляя свои персональные данные Оператору, я соглашаюсь с тем, что предоставленная мной информация будет использоваться Оператором с целями, определенными настоящим Согласием и Политикой. Также, я соглашаюсь с тем, что Оператор вправе поручить обработку моих Персональных данных третьим лицам, на основании заключаемого с такими лицами Договора, для реализации целей, определенных настоящим Согласием и Политикой.</p>
            <p>Я соглашаюсь, что в моих интересах мои персональные данные могут быть переданы партнерам Оператора в порядке, предусмотренном соответствующими правилами и нормами Российского законодательства.</p>
            <p>Я соглашаюсь с тем, что в соответствии с Законодательством Российской Федерации Оператор обязуется предоставить мои персональные данные Органам государственной власти и/или Органам местного самоуправления в случае поступления официального обоснованного и мотивированного запроса.</p>
            <p>Я подтверждаю, что указанные мной данные при регистрации и пользовании Сайта являются полными и достоверными.</p>
            <p>Настоящее согласие действует с момента предоставления данных бессрочно, и прекращается после достижения цели, с которой происходила обработка данных, либо по моему письменному заявлению - отзыву. Согласие может быть отозвано при условии письменного уведомления, направленного Оператору по адресу: <a href="mailto:info@birds.moscow">info@birds.moscow</a></p>
            <p>Я даю свое согласие на обработку персональных данных</p>
            <p>Я даю свое согласие на получение рассылки в виде sms-сообщений новостных, информационных и рекламных сообщений ООО &laquo;ИМЕДИ&raquo;</p>
            <p>Я даю свое согласие на получение рассылки в виде сообщений по электронной почте новостных, информационных и рекламных сообщений ООО &laquo;ИМЕДИ&raquo;</p>
            <p>Настоящим я подтверждаю, что все указанные в настоящем согласии данные верны, подтверждаю что указанный выше номер телефона является моим номером телефона, в отношении него между мной и оператором связи заключен договор оказания услуг связи, указанный мной адрес электронной почты оформлен на мое имя и готов нести ответственность за достоверность данных в настоящем согласии.</p>
          </b-col>
        </b-row>
      </b-container>
    </main>
  </div>
</template>

<script>

export default {
  components: { 

  },
  data() {
    return {
      isShow: false,
      arrowPos: 0,
      limitPosition: 100,
      scrolled: true,
      lastPosition: 0
    }
  },
  mounted: function () {
      //this.startRotation();
      //this.isShow = true;
      setTimeout(() => {
          this.isShow = true;
      }, 100);

                
  } ,
  methods: {

  },
  
  computed: {
  },
  beforeRouteLeave (to, from, next) {
      //this.$modal.hide();
      next()
    }
}
</script>

<style lang="scss">

.policy {
  
  padding-bottom: 4rem;

  h2 {
    text-transform: uppercase;
    margin-bottom: 3rem;
  }
}

</style>
