<template>
  <div class="terms" v-bind:class="{visible: isShow}">
    <header>
      <div class="social">
        <span><a href="#" class="fb"></a></span>
        <span><a href="#" class="ig"></a></span>
      </div>
      <div class="logo"><nuxt-link to="/"><img src="~assets/img/logo-dark.png" alt=""></nuxt-link></div>
      <div class="feedback">
          <a href="#" @click="showFeedbackModal()">Написать нам</a>
          <!-- <a href="#" @click="showSubscribeModal()">Подписка</a> -->
      </div>
    </header>
    <main>
      <div class="terms-content">


    <div class="container text-page">
        <div class="row pb-5">
            <div class="col">
                <h1 class="pb-4">Политика конфиденциальности Персональных данных</h1>
                <p>г.  Москва</p>
                <p>«01» октября 2019 г.</p>
                <p>Настоящая Политика конфиденциальности персональных данных (далее – Политика конфиденциальности)
                    действует в отношении всей информации, которую Интернет-магазин «Pe for girls»,
                    расположенный на доменном имени https://fqueens.ru/, может получить о Пользователе
                    во время использования сайта Интернет-магазина, программ и продуктов Интернет-магазина.</p>
                <ol class="list">
                    <li>
                        <p class="text-center">
                            <span>ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</span>
                        </p>
                        <p>1.1. В настоящей Политике конфиденциальности используются следующие термины:</p>
                        <p>1.1.1. «Администрация сайта Интернет-магазина (далее – Администрация сайта)» – сотрудники, уполномоченные на управление сайтом, действующие от имени ИП Дмитриенко Ю. В., которые организуют и (или) осуществляет обработку персональных данных, а также определяют цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.</p>
                        <p>1.1.2. «Персональные данные» - любая информация, относящаяся к прямо или косвенно к определенному или определяемому физическому лицу (субъекту персональных данных).</p>
                        <p>1.1.3. «Обработка персональных данных» - любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу третьим лицам (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.</p>
                        <p>1.1.4. «Конфиденциальность персональных данных» - обязательное для соблюдения Оператором или иным получившим доступ к персональным данным лицом требование не допускать их распространения без согласия субъекта персональных данных или наличия иного законного основания.</p>
                        <p>1.1.5. «Пользователь сайта Интернет-магазина (далее Пользователь)» – лицо, имеющее доступ к Сайту посредством сети Интернет и использующее Сайт интернет-магазина.</p>
                        <p>1.1.6. «Cookies» — небольшой фрагмент данных, отправленный веб-сервером и хранимый на компьютере пользователя, который веб-клиент или веб-браузер каждый раз пересылает веб-серверу в HTTP-запросе при попытке открыть страницу соответствующего сайта.</p>
                        <p>1.1.7. «IP-адрес» — уникальный сетевой адрес узла в компьютерной сети, построенной по протоколу IP.</p>
                    </li>
                    <li>
                        <p class="text-center">
                            <span>ОБЩИЕ ПОЛОЖЕНИЯ</span>
                        </p>
                        <p>2.1. Использование Пользователем сайта Интернет-магазина означает согласие с настоящей Политикой конфиденциальности и условиями обработки персональных данных Пользователя.</p>
                        <p>2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь должен прекратить использование сайта Интернет-магазина.</p>
                        <p>2.3. Настоящая Политика конфиденциальности применяется только к сайту Интернет-магазина «Pe for girls». Интернет-магазин не контролирует и не несет ответственность за сайты третьих лиц, на которые Пользователь может перейти по ссылкам, доступным на сайте Интернет-магазина.</p>
                        <p>2.4. Администрация сайта не проверяет достоверность персональных данных, предоставляемых Пользователем сайта Интернет-магазина.</p>
                    </li>
                    <li>
                        <p class="text-center">
                            <span>ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</span>
                        </p>
                        <p>3.1. Настоящая Политика конфиденциальности устанавливает обязательства Администрации сайта интернет-магазина по неразглашению и обеспечению режима защиты конфиденциальности персональных данных, которые Пользователь предоставляет по запросу Администрации сайта при регистрации на сайте интернет-магазина или при оформлении заказа для приобретения Товара.</p>
                        <p>3.2. Персональные данные, разрешённые к обработке в рамках настоящей Политики конфиденциальности, предоставляются Пользователем путём заполнения регистрационной формы на Сайте интернет-магазина «Pe for girls» и включают в себя следующую информацию:</p>
                        <p>3.2.1. фамилию, имя, отчество Пользователя;</p>
                        <p>3.2.2. контактный телефон Пользователя;</p>
                        <p>3.2.3. адрес электронной почты (e-mail);</p>
                        <p>3.2.4. адрес доставки Товара;</p>
                        <p>3.2.5. место жительство Пользователя.</p>
                        <p>3.3. Интернет-магазин защищает Данные, которые автоматически передаются в процессе просмотра рекламных блоков и при посещении страниц, на которых установлен статистический скрипт системы ("пиксель"):
                            <br>• IP адрес;
                            <br>• информация из cookies;
                            <br>• информация о браузере (или иной программе, которая осуществляет доступ к показу рекламы);
                            <br>• время доступа;
                            <br>• адрес страницы, на которой расположен рекламный блок;
                            <br>• реферер (адрес предыдущей страницы).
                        </p>
                        <p>3.3.1. Отключение cookies может повлечь невозможность доступа к частям сайта Интернет-магазина, требующим авторизации.</p>
                        <p>3.3.2. Интернет-магазин осуществляет сбор статистики об IP-адресах своих посетителей. Данная информация используется с целью выявления и решения технических проблем, для контроля законности проводимых финансовых платежей.</p>
                        <p>3.4. Любая иная персональная информация неоговоренная выше (история покупок, используемые браузеры и операционные системы и т.д.) подлежит надежному хранению и нераспространению, за исключением случаев, предусмотренных в п.п. 5.2. и 5.3. настоящей Политики конфиденциальности.</p>
                    </li>
                    <li>
                        <p class="text-center">
                            <span>ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ</span>
                        </p>
                        <p>4.1. Персональные данные Пользователя Администрация сайта интернет-магазина может использовать в целях:</p>
                        <p>4.1.1. Идентификации Пользователя, зарегистрированного на сайте Интернет-магазина, для оформления заказа и (или) заключения Договора купли-продажи товара дистанционным способом с Интернет-магазином «Pe for girls».</p>
                        <p>4.1.2. Предоставления Пользователю доступа к персонализированным ресурсам Сайта интернет-магазина.</p>
                        <p>4.1.3. Установления с Пользователем обратной связи, включая направление уведомлений, запросов, касающихся использования Сайта интернет-магазина, оказания услуг, обработки запросов и заявок от Пользователя.</p>
                        <p>4.1.4. Определения места нахождения Пользователя для обеспечения безопасности, предотвращения мошенничества.</p>
                        <p>4.1.5. Подтверждения достоверности и полноты персональных данных, предоставленных Пользователем.</p>
                        <p>4.1.6. Создания учетной записи для совершения покупок, если Пользователь дал согласие на создание учетной записи.</p>
                        <p>4.1.7. Уведомления Пользователя Сайта интернет-магазина о состоянии Заказа.</p>
                        <p>4.1.8. Обработки и получения платежей, подтверждения налога или налоговых льгот, оспаривания платежа, определения права на получение кредитной линии Пользователем.</p>
                        <p>4.1.9. Предоставления Пользователю эффективной клиентской и технической поддержки при возникновении проблем, связанных с использованием Сайта интернет-магазина.</p>
                        <p>4.1.10. Предоставления Пользователю информации об обновлениях продукции, ценах, специальных предложениях, новостной рассылки и иных сведений от имени Интернет-магазина или от имени партнеров Интернет-магазина.</p>
                        <p>4.1.11. Осуществления рекламной деятельности с согласия Пользователя.</p>
                        <p>4.1.12. Предоставления доступа Пользователю на сайты или сервисы партнеров Интернет-магазина с целью получения продуктов, обновлений и услуг.</p>
                    </li>
                    <li>
                        <p class="text-center">
                            <span>СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ</span>
                        </p>
                        <p>5.1. Обработка персональных данных Пользователя осуществляется без ограничения срока, любым законным способом, в том числе в информационных системах персональных данных с использованием средств автоматизации или без использования таких средств.</p>
                        <p>5.2. Пользователь соглашается с тем, что Администрация сайта вправе передавать персональные данные третьим лицам, в частности, курьерским службам, организациями почтовой связи, операторам электросвязи, исключительно в целях выполнения заказа Пользователя, оформленного на Сайте интернет-магазина «Pe for girls», включая доставку Товара.</p>
                        <p>5.3. Персональные данные Пользователя могут быть переданы уполномоченным органам государственной власти Российской Федерации только по основаниям и в порядке, установленным законодательством Российской Федерации.</p>
                        <p>5.4. При утрате или разглашении персональных данных Администрация сайта информирует Пользователя об утрате или разглашении персональных данных.</p>
                        <p>5.5. Администрация сайта принимает необходимые организационные и технические меры для защиты персональной информации Пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий третьих лиц.</p>
                        <p>5.6. Администрация сайта совместно с Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных последствий, вызванных утратой или разглашением персональных данных Пользователя.</p>
                    </li>
                    <li>
                        <p class="text-center">
                            <span>ОБЯЗАТЕЛЬСТВА СТОРОН</span>
                        </p>
                        <p>6.1. Пользователь обязан:</p>
                        <p>6.1.1. Предоставить информацию о персональных данных, необходимую для пользования Сайтом интернет-магазина.</p>
                        <p>6.1.2. Обновить, дополнить предоставленную информацию о персональных данных в случае изменения данной информации.</p>
                        <p>6.2. Администрация сайта обязана:</p>
                        <p>6.2.1. Использовать полученную информацию исключительно для целей, указанных в п. 4 настоящей Политики конфиденциальности.</p>
                        <p>6.2.2. Обеспечить хранение конфиденциальной информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными способами переданных персональных данных Пользователя, за исключением п.п. 5.2. и 5.3. настоящей Политики Конфиденциальности.</p>
                        <p>6.2.3. Принимать меры предосторожности для защиты конфиденциальности персональных данных Пользователя согласно порядка, обычно используемого для защиты такого рода информации в существующем деловом обороте.</p>
                        <p>6.2.4. Осуществить блокирование персональных данных, относящихся к соответствующему Пользователю, с момента обращения или запроса Пользователя или его законного представителя либо уполномоченного органа по защите прав субъектов персональных данных на период проверки, в случае выявления недостоверных персональных данных или неправомерных действий.</p>
                    </li>
                    <li>
                        <p class="text-center">
                            <span>ОТВЕТСТВЕННОСТЬ СТОРОН</span>
                        </p>
                        <p>7.1. Администрация сайта, не исполнившая свои обязательства, несёт ответственность за убытки, понесённые Пользователем в связи с неправомерным использованием персональных данных, в соответствии с законодательством Российской Федерации, за исключением случаев, предусмотренных п.п. 5.2., 5.3. и 7.2. настоящей Политики Конфиденциальности.</p>
                        <p>7.2. В случае утраты или разглашения Конфиденциальной информации Администрация сайта не несёт ответственность, если данная конфиденциальная информация:</p>
                        <p>7.2.1. Стала публичным достоянием до её утраты или разглашения.</p>
                        <p>7.2.2. Была получена от третьей стороны до момента её получения Администрацией сайта.</p>
                        <p>7.2.3. Была разглашена с согласия Пользователя.</p>
                    </li>
                    <li>
                        <p class="text-center">
                            <span>РАЗРЕШЕНИЕ СПОРОВ</span>
                        </p>
                        <p>8.1. До обращения в суд с иском по спорам, возникающим из отношений между Пользователем сайта Интернет-магазина и Администрацией сайта, обязательным является предъявление претензии (письменного предложения о добровольном урегулировании спора).</p>
                        <p>8.2. Получатель претензии в течение 30 календарных дней со дня получения претензии, письменно уведомляет заявителя претензии о результатах рассмотрения претензии.</p>
                        <p>8.3. При не достижении соглашения спор будет передан на рассмотрение в судебный орган в соответствии с действующим законодательством Российской Федерации.</p>
                        <p>8.4. К настоящей Политике конфиденциальности и отношениям между Пользователем и Администрацией сайта применяется действующее законодательство Российской Федерации.</p>
                    </li>
                    <li>
                        <p class="text-center">
                            <span>ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</span>
                        </p>
                        <p>9.1. Администрация сайта вправе вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя.</p>
                        <p>9.2. Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте интернет-магазина, если иное не предусмотрено новой редакцией Политики конфиденциальности.</p>
                        <p>9.3. Все предложения или вопросы по настоящей Политике конфиденциальности следует сообщать на контактную почту сайта интернет-магазина.</p>
                        <p>9.4. Действующая Политика конфиденциальности размещена на странице по адресу https://fqueens.ru/privacy/</p>
                    </li>
                </ol>

            </div>
        </div>
    </div>


      </div>
  
    </main>
    
  </div>
</template>

<script>

import ModalFeedback from '~/components/ModalFeedback.vue'
import ModalSubscribe from '~/components/ModalSubscribe.vue'

export default {
  components: { 
      
      ModalFeedback,
      ModalSubscribe

  },
  data() {
    return {
      isShow: true,
    }
  },
  mounted: function () {
    this.hideOrderModal()
    setTimeout(() => {
        this.isShow = true;
      }, 500);
   
},
  methods: {
      startRotation: function() {
          this.timer = setInterval(this.next, 7000);
      },

      stopRotation: function() {
          clearTimeout(this.timer);
          this.timer = null;
      },

      next: function() {
          this.currentNumber += 1
      },
      prev: function() {
          this.currentNumber -= 1
      },
      showFeedbackModal (data) {
        this.$modal.show(ModalFeedback, {
        }, {
          draggable: false,
          width: 600,
          height: 410,

        },{
          //'before-open': this.beforeOpen(data),
          // 'before-close': this.beforeClose
        })
      },
      showSubscribeModal (data) {
        this.$modal.show(ModalSubscribe, {
        }, {
          draggable: false,
          width: 700,
          height: 340,

        },{
          //'before-open': this.beforeOpen(data),
          // 'before-close': this.beforeClose
        })
      },
      hideOrderModal () {
        this.$modal.hide(ModalSubscribe);
      },
      newsletterToggle: function(){
            this.newsletterIsActive = !this.newsletterIsActive;
      },
      emailSend() {

      }
  },
  computed: {
    currentImage: function() {
      	return this.images[Math.abs(this.currentNumber) % this.images.length];
      }
  },
  mounted() {
    
  }
}
</script>

<style scoped>

@import url('https://fonts.googleapis.com/css?family=EB+Garamond:400,400i,500,500i,700,700i|Open+Sans:300,400,600,700&display=swap&subset=cyrillic');

body {
  background: #000;
  font-family: 'Open Sans', sans-serif;
}

.terms{
    background: #fff;
    padding-top: 250px;
}

@keyframes header-on {
    0% {top: -200px;}
    100% {top: 0;}
}


header {
  position: absolute;
  opacity: 0;
  top: -50px;
  left: 0;
  width: 100%;
  display: flex;
  justify-content: space-between;
  z-index: 999;
  padding: 2rem 4rem;
  transition-property: opacity, top;
  transition-duration: 1s;
  transition-timing-function: ease;
  transition-delay: .25s;

}

.visible header {
  opacity: 1;
  top: 0;
}

header .logo{
  width: 300px;
}

header .logo img {
  width: 100%;
}

.social {
    width: 200px;
    display: flex;
    justify-content: flex-start;
    height: max-content;
    padding-top: 25px;
}

.social span {
    padding-right: 20px;
}

.social .fb {
  display: inline-block;
  width: 24px;
  height: 24px;
  background-size: 100%;
  background-repeat: no-repeat;
  background-image: url('~assets/img/ic-fb-dark.svg')
}

.social .ig {
  display: inline-block;
  width: 24px;
  height: 24px;
  background-size: 100%;
  background-repeat: no-repeat;
  background-image: url('~assets/img/ic-ig-dark.svg')
}

.social a {
  transition-property: opacity;
  transition-duration: .25s;
  transition-timing-function: ease;
}

.social a:hover {
  opacity: .75
}

.feedback {
    width: 200px;
    display: flex;
    justify-content: flex-end;
    padding-top: 20px;
}

.feedback a {
    color: #000;
    padding: 10px 15px;
    background: transparent;
    border: 1px solid #000;
    border-radius: 1px;
    display: block;
    height: max-content;
    text-decoration: none;
    text-transform: uppercase;
    font-size: .75rem;
    font-weight: 600;
    letter-spacing: 1px;
    transition-property: opacity;
    transition-duration: .25s;
    transition-timing-function: ease;
}

.feedback a:hover {
    opacity: .75;
}

.terms-content {
    background: #fff;
    position: relative;
    max-width: 1140px;
    padding: 4rem;
    margin: 0 auto;
}

.pb-4, .py-4 {
    padding-bottom: 1.5rem!important;
}

p {
    margin-top: 0;
    margin-bottom: 1rem;
}

ol.list {
    counter-reset: li;
    list-style: none;
}

.list li {
    text-align: justify;
}


@media (min-width: 320px) and (max-width: 480px) { 
  
  header {
    flex-direction: column-reverse;
    align-items: center;
  }
  header .logo {
    width: 250px;
  }
  header .social {
    display: none;
    position: fixed;
    bottom: 6rem;
    left: 50%;
    margin-left: -100px;
    justify-content: center;
  }

  header .social span{
    padding: 0 10px;
  }

  header .feedback {
    display: none;
    position: fixed;
    bottom: 2rem;
    left: 50%;
    margin-left: -100px;
    justify-content: center;
  }


  .v--modal-overlay .v--modal-background-click {
    display: flex;
    justify-content: center;
  }

  .v--modal-overlay .v--modal-box {
      width: 90%!important;
      left: 0!important;
      top: 18vh!important;
      height: 420px!important;
  }

  .terms {
      background: #fff;
      padding-top: 160px;
  }

  .terms-content{
      padding: 1rem;
  }
}

</style>
